<a href="https://colab.research.google.com/github/mohd-faizy/_Pandas_CodeDump/blob/master/07_Missing_Data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

--- 
<strong> 
    <h1 align='center'>Missing Data</h1> 
</strong>

---

Let's show a few convenient methods to deal with Missing Data in pandas:

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'A':[1,2,np.nan],
                   'B':[5,np.nan,np.nan],
                   'C':[1,np.nan,3]})

In [3]:
df

     A    B    C
0  1.0  5.0  1.0
1  2.0  NaN  NaN
2  NaN  NaN  3.0

In [4]:
df.dropna() # Default axis=0 -- Row

     A    B    C
0  1.0  5.0  1.0

In [5]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [6]:
df.dropna(thresh=2)

     A    B    C
0  1.0  5.0  1.0

In [10]:
df.fillna(value='X')

   A  B  C
0  1  5  1
1  2  X  X
2  X  X  3

In [8]:
df.fillna(value=df.mean())

     A    B    C
0  1.0  5.0  1.0
1  2.0  5.0  2.0
2  1.5  5.0  3.0

In [9]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64